In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
from numpy.random import randn

In [3]:
ser = Series(randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])
ser

1  a    0.407724
   b    0.022625
   c   -0.296410
2  a   -0.377623
   b    0.084930
   c    1.327578
dtype: float64

In [4]:
ser.index

MultiIndex(levels=[[1, 2], [u'a', u'b', u'c']],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [5]:
ser[1]

a    0.407724
b    0.022625
c   -0.296410
dtype: float64

In [6]:
ser[2]

a   -0.377623
b    0.084930
c    1.327578
dtype: float64

In [7]:
ser

1  a    0.407724
   b    0.022625
   c   -0.296410
2  a   -0.377623
   b    0.084930
   c    1.327578
dtype: float64

In [8]:
ser[:,'a']

1    0.407724
2   -0.377623
dtype: float64

In [9]:
dframe = ser.unstack()
dframe

          a         b         c
1  0.407724  0.022625 -0.296410
2 -0.377623  0.084930  1.327578

In [10]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),
                    index=[['a','a','b','b'],[1,2,1,2]],
                   columns=[['SBY','SBY','MLG','STB'],['cold','hot','hot','cold']])
dframe2

     SBY     MLG  STB
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [11]:
dframe2.index.names = ['INDEX_1','INDEX_2']
dframe2.columns.names = ['Kota','Temp']
dframe2

Kota             SBY     MLG  STB
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [12]:
dframe2.swaplevel('Kota','Temp',axis=1)

Temp            cold hot     cold
Kota             SBY SBY MLG  STB
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [13]:
dframe2.sort_index(1)

Kota            MLG  SBY      STB
Temp            hot cold hot cold
INDEX_1 INDEX_2
a       1         2    0   1    3
        2         6    4   5    7
b       1        10    8   9   11
        2        14   12  13   15

In [14]:
dframe2

Kota             SBY     MLG  STB
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [15]:
dframe2.sum(level='Temp',axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27